# Data Wrangling for Toronto Property Price Analysis Project

In [1]:
import re
import os
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pylab as plt

Load the dataset.

In [2]:
data = pd.read_excel(os.getcwd()+'/combined_toronto_property_data.xlsx')
data.head()

      price    region                             address bedrooms  bathrooms
0  $799,000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  $989,000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario    2 + 1        1.0
2  $999,900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  $799,900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  $899,999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

Check the size of the dataset.

In [3]:
data.shape

(7756, 5)

The first number in the above bracket shows the number of rows dataset contains, while the second number shows the total number of columns in the dataset.

See the missing values in the dataset.

In [4]:
data.isna().sum()

price          5
region         0
address        5
bedrooms     225
bathrooms    391
dtype: int64

Drop all the rows from the dataset containing missing values.

In [5]:
data.dropna(inplace= True)
data.shape

(7365, 5)

Confirm no missing values remain in the dataset.

In [6]:
data.isna().sum()

price        0
region       0
address      0
bedrooms     0
bathrooms    0
dtype: int64

In [7]:
data.head()

      price    region                             address bedrooms  bathrooms
0  $799,000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  $989,000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario    2 + 1        1.0
2  $999,900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  $799,900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  $899,999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

Remove the $ sign and commas from the **price** column.

In [8]:
price = data['price']
price = price.apply(lambda x : x.replace('$', ''))
price = price.apply(lambda x : x.replace(',', ''))
data['price'] = price
data.head()

    price    region                             address bedrooms  bathrooms
0  799000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  989000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario    2 + 1        1.0
2  999900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  799900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  899999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

Again check the size of the data.

In [9]:
data.shape

(7365, 5)

Keep only the entries in the **price** column that are digits.

In [10]:
data['price'] = data['price'].str.extract(r'(\d+)')
data.head()

    price    region                             address bedrooms  bathrooms
0  799000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  989000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario    2 + 1        1.0
2  999900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  799900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  899999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

In [11]:
data.shape

(7365, 5)

Check the datatype in each column of the dataset.

In [12]:
data.dtypes

price         object
region        object
address       object
bedrooms      object
bathrooms    float64
dtype: object

Convert the **price** column datatype from object to integer.

In [13]:
data = data.astype({'price' : 'int'})

In [14]:
data.dtypes

price          int64
region        object
address       object
bedrooms      object
bathrooms    float64
dtype: object

In [15]:
data.head()

    price    region                             address bedrooms  bathrooms
0  799000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  989000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario    2 + 1        1.0
2  999900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  799900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  899999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

Keep only the digit entries in the **bedrooms** and **bathrooms** column.

In [16]:
data['bedrooms'] = data['bedrooms'].str.extract(r'(\d+)')

In [17]:
data.head()

    price    region                             address bedrooms  bathrooms
0  799000  Ajax, ON           2 ROLLO DR, Ajax, Ontario        3        3.0
1  989000  Ajax, ON  717 OLD HARWOOD AVE, Ajax, Ontario        2        1.0
2  999900  Ajax, ON       52 ADDLEY CRES, Ajax, Ontario        3        4.0
3  799900  Ajax, ON      249 MONARCH AVE, Ajax, Ontario        3        3.0
4  899999  Ajax, ON         18 MONK CRES, Ajax, Ontario        3        3.0

Convert the both **bedrooms** and **bathrooms** column datatype from object to integer.

In [18]:
data = data.astype({'bedrooms' : 'int'})
data = data.astype({'bathrooms' : 'int'})

In [19]:
data.dtypes

price         int64
region       object
address      object
bedrooms      int64
bathrooms     int64
dtype: object

Quickly take a look at some basic statistical parameters of each column in the dataset.

In [20]:
data.describe()

              price     bedrooms    bathrooms
count  7.365000e+03  7365.000000  7365.000000
mean   1.437414e+06     3.051867     2.965377
std    1.346884e+06     1.098502     1.406616
min    1.000000e+00     0.000000     0.000000
25%    7.990000e+05     2.000000     2.000000
50%    1.099000e+06     3.000000     3.000000
75%    1.599900e+06     4.000000     4.000000
max    2.797500e+07     9.000000    15.000000

In [21]:
data.shape

(7365, 5)

Filter data with price > 350000

In [22]:
data = data[data['price'] > 350000]

In [23]:
data.shape

(7324, 5)

Again take a quick look at some basic statistical paramters of each column in the dataset.

In [24]:
data.describe()

              price     bedrooms    bathrooms
count  7.324000e+03  7324.000000  7324.000000
mean   1.444227e+06     3.062125     2.976106
std    1.347525e+06     1.087886     1.401255
min    3.590000e+05     0.000000     0.000000
25%    7.997942e+05     2.000000     2.000000
50%    1.099000e+06     3.000000     3.000000
75%    1.599999e+06     4.000000     4.000000
max    2.797500e+07     9.000000    15.000000

In [25]:
data.dtypes

price         int64
region       object
address      object
bedrooms      int64
bathrooms     int64
dtype: object

Add another column named **pricem**, containing price in the unit of million dollars.

In [26]:
data['pricem'] = data['price']/1000000

Save the cleaned dataset to an excel file.

In [27]:
data.to_excel(excel_writer= os.getcwd()+'/clean_combined_toronto_property_data.xlsx', index = False)